#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "57e7df2d7008c3c7b65eb26cdda799c5" -> "d2788b82c29b372d1c7ef3e4ca46fd78"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "3788f3ca9847cb837dbd887e44d7aab9" -> "88561101475e8c6cc40984d5750c2aba"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "50cfe056180b1f3ced2c0fb951fb6c3d" -> "83bd78307d1ab54faeb4cee438eb61e5"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3338b0ae0fabef57b7178c9412547a20" -> "c214bae59b1cba0ca1769b57c405ec44"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "4128595fb4896322d51a0f88da9865a2" -> "fa4525f4289e903263687c7f371eb6bc"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "4d5a2ed77bc7429d702c26f61da5cbf4" -> "87d87ab9e5adcce5de78483961f0cbaa"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "4cad8c9e52c160d034dee79d9aeb4e19" -> "c71260c4f52840bfadc046d5e617e52c"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "81b6db2cec02158a020b21f57782af4e" -> "b456e54f657ad4520992ac0d3db3b7be"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "82b1947b91029fb01001a5f73695b2a4" -> "6a00dc0fddc019059bd7956220b60aeb"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "b92ffb7d131303149f999989018ac2d0" -> "cc9c73604d16cdb57d05f7425f8b2466"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "30efeda4f726b03946fc99aba22dacb2" -> "d1a1305f091959d3a96b1c2c2edb3dd6"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "0094a083cc567a2205f013ad94864190" -> "c9d4d2a5ae450a41e40bb6ff46668d2e"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "b6054a6d436b75f795c5f95343aee14e" -> "27acd6e9dc60d61514ea06ae3d0f0996"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "b18d05f276b6a4cb86ba1e43e9082b20" -> "bddb37932e2e22a2e4d23565f330f805"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "c43d1e3824da4a3b97af210ea673eb0e" -> "f0daa63aa95d2060f7fa592369b01e0e"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "73a3525e82c21ca7deb6837e6cf33b6e" -> "867ed90074569d676440d31f06784ec5"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "17a6ba5c446649365c7596118d0160d3" -> "9a23814bee964dff27fa8bf4d1608c1a"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "c9c8aafa641cc76599683a4eb6c0c1a1" -> "a30f35853dcb89f6c4a7a58bc6a18a1f"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "bff862d2d38f219185c99699dfa1032c" -> "1c1c53cf5755900c6f397516968541e2"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "4847992625bfadd227ff0bd118552f64" -> "624763611e011e201e5e195909b39558"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "843f85011caed13e338e200803aa1b21" -> "ebdb25c8848301158bc815a26744efb3"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "329024f0a63139263902c9e15e0cee2c" -> "1d19ac6850f56754ca26a366905ce081"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "729dfcb9ef73047e0fb962337a133876" -> "18d0ab1d8b10c00c0067da217c0893d5"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7feffae0a98bbadffeec6a058b6f1005" -> "64557658b96501200cff33e36bbf0c46"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "faa82e5a9ae8b0ddd4db9bc742214b84" -> "8cd2014f28bdf5b87edf678274bb83ce"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "73ae59aa85ace038963371d0e2fa8da1" -> "df6a7abbb272bc8758bfe71098aea59e"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "4e65a87c18a074fcdbc7901add4798fe" -> "56cf24faabb7b2941cd70894136936b1"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "6ba2428a7658baca45fb9bc9b395c630" -> "c6ef956211bc3fbe731c9be1040ff060"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "ceaf4e0abf3fbe0e6084d53e18d4e887" -> "bad025a4e5e112b6a21db9381ad41c1f"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "d61b469d306a7979ef5b8cf766e37f2d" -> "c84ec5f489be79209a34983fa58f814b"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e5a81844d54291b93e7f5be1aaf55e2c" -> "239f0e28239607dab5c47427d3267225"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "93ef87cfd24f93ebfc7475296a4b212b" -> "ee39719a8afba3634022c7d618d61141"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "d389acca54530a36b5461c3b72f7ddaf" -> "11889d9de91060510ed21a1a8eca2885"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "59b202daae3eb987a792b3235ba33a9f" -> "c51f298e9b453ba086a7eb9fd6c58ffb"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7ffa0824538bb8aaa7c1e01e758bce4a" -> "4c3d320303b1ca6f7024995bb8157d71"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "410744dd310b75ddd72c69d9c692a0c9" -> "2ac427d48168f745f6fa976893aca0ca"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "65b7280c8faa0d2a3d1054f667b8fea0" -> "2ca6b5bdc309e902515959eb01b7b171"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "b25a9d77a1b23a599e80d1a43d6077a7" -> "22a5baa55b5ffd689437b2ba39777234"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "45b55f3b8cd5f52c117f04c3a028e2e8" -> "1da4b314bf8dd2d6ec50319dd01d7a53"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "8e99825a2b9d9bbd16fb92d155271739" -> "bfd4158dcd60e66e6bf650a9296511cb"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0c4d1a4b9125b515e0c8ec194bce82ac" -> "c2110530fb7324146953bd07dfc8f743"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "a82aa38a051f8139e9ac98a867339815" -> "e05ae42e89698ecbc9bb6c57569721cd"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "d19aaae81f73f1a9ffd0e1ccc0473c21" -> "59c09f16172cb70e3df8367123b8c6ea"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "c9202f098bd7304518dd5e09b9ad78ee" -> "e860d7a36b240c22deb9028d89885e88"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "571f0a65a82dd60396a6ca7290ef34d1" -> "b843766bf1be3b3f478c1427546c1f01"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "406f4a95ec5b6dfc867ccfb975280aaa" -> "44341a00748d7a7a2df6addac25681f6"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "bcdf3a62cb64a2e81e65c6902814564c" -> "aa76305a8c7be97f7eb1fda894002daf"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwm+aoys4laM3glwLemKzM31dQ0S0TfzM8OakW2iMdU=" -> "dVPjvgNFaFHjEARabDNlOQ31UsM9uyHBIPwivh8lqWY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "m99kbbBh/8Q7UC1QfN2CVFAcRsqXVwQIbm/tvu263D4=" -> "RmjDsOZ+DtKEAufCT5+haRe9qbiok1GGUmzr1XFdWLg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "TiBSblOERlt/sHuMucn8SpfVwQJnf1QVqgxSQtDv4Ks=" -> "ie0Z2OBbBwX+Q0UFk2YtGTD5Sl2XFPASMhe3HryRy40="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "lKJ4ChD3apQMyojKFi1pRATz7B7ueuKVyxNYhixuDGg=" -> "9siYj4Br1tPnoG1N887vYqxH36kGM1oEAjMLJKzIqpg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "zHFS1w/N4akZ+41NlR/AF21rCMZyuNSwO1xjwcCPMoM=" -> "gUsZiwkgWSXIXDacxT9Ix8u14y8ne/rWStzNVZzUYAk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "+oga4d977S0jr5/DOZ1veVxyJZhk3NXZNK4nYJC9tFw=" -> "eFtORiHI+5p8WpPD4JCqh5u8b7hNW+zTR2t60OLH7uY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "1h9QqJPG4IQpGmZ0i6f6yuQdbz/8dPGuwl0oobhCCLY=" -> "nBWvI2nQpNej6jY0pkCmRXq7MJrKQutd+qYfEYALYNg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "dy0wEB93P2GPMkNkfihQqZwUzPkSHGyez2jaoaMWVKE=" -> "QznfmjXqCUpknh0iT4t3d2RkzUF/085v3Q5jPeKXWsw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "mNftg8hYhgqvf7yDw8/NuyDB8idr1TMwcrZEclNwoeQ=" -> "G5/A+4O2bDDz7q4yLyg2++0AC5AOA+H3jOKZwFBpoHk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "I3IpC2DozXpvIbxZme9P0SSO0e1dzGJgjAo3FG9n/SY=" -> "g42Nw6Nwnzsoocsyr3UBXR9foNwwkjoKFxVfUQVA/po="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bapcxv+aAgBT+OaCYQnOLleDT29WTZl9FmiNGovy2cM=" -> "QhyE8Bxj2WMq347eMvEwYM+SrxLCunD9KIdtPW8vxgQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "YklKY07FPBupAVSJ/tNsTlvmB4Cx5TwC6nX/9YzsNGU=" -> "UAtX+9ZO9fN0qHTYmLKv5Xv5eH7qfKxg26sZZTLr06s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "4EYGTiheQ5QO5OquoKW08kPFo5Atk5DE+/Ho6U5R/Og=" -> "/mxaWmw8DJhkYCaSS+vzx+0kkfKIHSVuVn8Vexwvs80="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "VQ49ajF8i8BCcwWYMbTry8CIajm/WN9JyfpBaEZ7lDI=" -> "pSh2hTSHyiYSj5WroUBNe8OZCTctk2LCtnB7tWLeGR0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "9BYQf1zMDeQ7VxmEz6/3VDab8Do7P2ddG9Nbd9UM/ME=" -> "yJHTRb3vxoY9ZU84OK5cs567D3h5fIEZqHCCsn/Juz0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "qiHWduLehLrYvBy0ALSwz3thl5SVJybBvJXZo22aLeA=" -> "4VOov4EgkqxzZcldn0TDRjrnbJLcJzCES6XtwgIxj9k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "bQQUrDU0T+ow8iA0ugTAElOcSXXL46NgKiTLqf5w40k=" -> "cqBQwuxyhQ8ZnBmNHzLjjAAUNmvxV+uWWuTymj/K/K0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hm8Fq6ensImSqGEBzASJQemVpaQhcB26utSQWNm+69g=" -> "fzzL/UM1zr4hb21vdsEwOb0SynGKRw0eoPbaWiLoXDQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "D7vxwMI0VC+WgmYBrV+PsyMwxBx1RQyFqE5IcEqwGm8=" -> "6k6ZZZg+xTJ2CBqrTRrfqobRtOiXwvDLzgQsTmPfeyY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gWqGCw6XrIyE0u/IUJSE0A6JJu8Z25yiU6Ga+2Kk2rA=" -> "WmRHsEgLSEksOck0aMHvKh3t4GqoewUCJ4kefnYVvvw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "cD9WEkBlxLYRxNUPk5cNRukH+lGUBTQKxKvPn9Ho5Oc=" -> "M+Qw+2Z59xNw+TyFdlw4VbyLvwzeWU1glBt3DfID6LI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "rJqfftO8Se8mWFrdtNiTao2JTpL3+aY4TZ3MnSxGWUw=" -> "wgN6tHROJInJDdVl6PBpeKCptVMB8nT+9EvAdSNjVYQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "krIkaCfsFGAVlqmICq2WWHv8IFTXudxy3FJV6YbHuBg=" -> "QIjPUliCrvFW5/5od3spjqG2TASIiD4DuKrykNFYV/A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8iWEQ25RGECFbHbOxuzv3ZB2qEHc/l/7cBAjWl9cMY=" -> "5QUvvkUrXL1QF5BtSJoVT/WOsq9MZJhkSQhDUGKKGms="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBjkuWbuyOKg9OWX6gY0Su80gQD99nJ3Z1VaAqrZ6dM=" -> "GkK4OYUp7m0R7xmYRErafSEz/jylMIc5l6rCsYWUf1Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "beXM3QnGZjyKdxt+5bqtjwHcyGgPA4w/pNbLcUelmk4=" -> "VrwXOHjqstrDY2oejjJvhHh8y36M1+aJYhm538xv9zI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "8B//IRMBXi6bNtohBuIRcGlVyyIAKz86Eyx2XZudSSQ=" -> "LPtCQuqatW28JGKu1rXQf4gwZR53PTRS7hujaz0RzK8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "lC1FmgkT5ZQbpXXEOMskDJpQjlzBPiklYBCd53IGo6s=" -> "jaFmEm9Cad/ZvCXvMHi0/zNsTpJ3GwEukwnJE9G8G1s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "zcQ5pjPZwrGTqp/C89uj9jV3lUiiSUflCSvhmbJk1Z4=" -> "ytx1tUrt18MwH0NVgSCj5idzbeUgS518A5tX9IrAc4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "6hkOPDDfAMSHBjbFtp+H2Hvdb4sMibwVy+sxoOQ84KM=" -> "q/2Zoa0dX3nl4D+SyTBpOEL8ZbYjKwyXOZEJ8AwnDJA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-10T21:04:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "dx81ziWWu7uB8T42bE5T3OOTfVjd2Pj8slt1f51uo2s=" -> "HVIxmp+QrPlYVl6eNEUxO1JnqkVzn4AeqCFIBvp4kaU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "aa+vWUHgeNxVQHVVD8Gj5VpG/hEkmwQANxCApQzAoLg=" -> "CgzWeVQ/IZPLOOTMuvJcs0SuSlrmHfGSyGmqedzeGnc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "ObiT14FEby8/jmkhvjoeJtbBpOHtqaNdnu9rJ2OI/y0=" -> "vkuEzA71TXeEuWvwi3+BR60SERvy1KVd5LHBBefvAs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ODBb4BnMAwn3pVIokHyP4gdxVjyDsNmP6WbyH1pESjc=" -> "4q1fhPKvFGf+JBqUx5oug35ylOT25er0wywAb43Hrvg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "cZ0WGzTSTXuIC/sFj0YOBm8ztcGHIxJOqgvfBdmt+Sk=" -> "QFc6YOzKwnDwTF3NbZrzX7uPJsnzCAS4ofQHaUBYBzI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "0SCcUONwwVG00AeW3fUIqRxiNK51RvWR5RF3KnfkBWc=" -> "NjkNie49Cb+riWKTSw0fvGs/aZI9V6IPIEOrANbp88s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "F5Bt66sSh13xbtA2O8peJFnWwpsofbM0/zOWM4TbMFw=" -> "2J4rBgQTF0ieHSs5fbFC75HbEDSBYrMvusI1qtGWDl4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pfiZ/qkphf9P0mQvpw1PmJXwf8hfw5Mjijam9PEsv/0=" -> "VVtdSs56jEM7qYJhz7PcGC8k1l61RyjhuGBDc/gz9Lg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "C3IqP8JCpZctg8T0Y0Mjc8j4KKT+f0Ay5K8Jv84C0nA=" -> "WIuPs3WI4vVt4y349cCdDwBWjJxAzCoRMv3MzR8xIaQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvZzWvomp7sD//F/8bh/dCPwLg9OjaS/0PSYZzHz5F0=" -> "sCUfL0N+tcZDoxNICvuN+7bOyi2DCYICO0tfrJS3Q9k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmQCYcvj4YCYnCa8nPjCdA8lZNhk7MLJsvzdZF8e10M=" -> "b9mqON+4U0FIPTkYK5Xe6F/nbsajwbaStUy9x7cEP0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "/aOdUCsru9JBvpom/W/5LPfl8eaOAaBfwo5eG+/rKEs=" -> "o+XblFFPudkZww8M1WR5fRCi7wmZbtji4FFx9QtFf5k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gqoo3Sb/iM7P25W3RFv6LRii8lUfhqXxPf+wF7YyJ2Y=" -> "yttBi9mEorj3KFyD/X69c0F/iB5CIwy0H/PKOmPBV/Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "g72H21hzjs5j+x0s/n1xP8hBuwU3VQ/c+S8NacRWwRk=" -> "riK6wHye+9mZalZJfUyR9+l8+4OdXfkdnQ3eqqC8UOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "QUA1r8+lCwOGtqRRbBKW19SQa33cWhdDO3cW6PFXPbI=" -> "8yKnr0tyXn69xAvrqXUWecmCOrGjlDe6s9QcyOVzzQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jt04wz7VQqw+29CemxqdsUdykAe06EojceTyr9p+lKY=" -> "R7PJBFKEa3bvMC4PPSE2XMEeIvWCJ23SW4vUB3r+SKY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-03T07:41:23Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "30bbte" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.quarters_report_method will be updated in-place
  ~ resource "aws_api_gateway_method" "quarters_report_method" {
        id                   = "agm-kb7gblbu69-gfvl0r-GET"
      ~ request_parameters   = {
          + "method.request.querystring.period"           = false
          ~ "method.request.querystring.years"            = true -> false
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 96 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*